Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.AnalyticalLinkJoinedNodes Property
 Analitycal Link is invalid. Reference nodes have been joined.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AnalyticalLinkJoinedNodes { get; }
Public Shared ReadOnly Property AnalyticalLinkJoinedNodes As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AnalyticalLinkJoinedNodes {
	FailureDefinitionId^ get ();
}
static member AnalyticalLinkJoinedNodes : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace